// 1)რა განსხვავებაა let, const შორის?
//let გამოიყენება ისეთი ცვლადებისთვის,რომლის მნიშვნელობა შეიძლება შეიცვალოს,ხოლო const გამოიყენება მუდმივი ცვლადებისთვის,რომლის მნიშვნელობის შეცვლა არ შეიძლება,მაგრამ თუ constით გამოცხადებულია ობიექტი ან მასივი მისი შიგთავსის შეცვლა დასაშვებია.
// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
//პრიმიტიული:string,number,boolean,undefined,null,symbol,bigInt,ინახება მნიშვნელობით,უცვლელია(immutable) და ინახება მეხსიერების სტეკზე.
//არაპრიმიტიული:object,function,array,ინახება მისამართით,არის mutable და ინახება მეხსიერების ჰიპზე.
// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
// == ადარებს მხოლოდ მნიშვნელობებს და საჭიროების შემთხვევაში აკეთებს კონვერსიას,ხოლო === ადარებს როგორც მნიშვნელობებს ასევე ტიპებს,არ ხდება კონვერსია.
// 4)რა ტიპის არის null
//პრიმიტიული ტიპი,რომელიც წარმოადგენს ცარიელ ან არარსებულ მნიშვნელობას,მაგრამ typeof null იძლწვა "object".
// 5)რა განსხვავებაა funtion და = () => {} შორის
//arrow უფრო კომპაქტურია,არ აქვს საკუტარი this,იღებს ლექსიკალური სკოუპიდან,არ აქვს arguments ობიექტი და არ შეიძლება გამოყენბებული იქნას როგორც კონსტრუქტორი.
// 6)რას ნიშნავს callback function?
//ფუნქცია რომელიც გადაეცემა სხვა ფუნქციას არგუმენტად და იძახება მას შემდეგ რაც გარკვეული ოპერაცია შესრულდება,ის ხშირად გამოიყენება ასინქრონულ ოპერაციებში»
// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
//map გადაუვლის მასივის თითეულ ელემენტს და ასრულებს მასზე მოქმეედებას,აბრუნებს ახალ მასივს ზუსტად იგივე სიგრძით,filter ამოწმებს მასივის ელემენტებს გარკვეულ პირობაზე,რომელშიც მხოლოდ ის ელემენტები მოხვდება რომლებმაც დააკმაყოფილეს პირობა.
//reduce გადაუვლის მასივს და აკუმულატორით აყველა ელემენტი დაჰყავს ერთ მნიშვნელობამდე.
// 8)რა არის Promise?
//პრომისი არის ობიექტი რომელიც წარმოადგენს ასინქრონული ოპერაციის საბოლოო დასრულებას წარმატებით ან წარუმატებლას და მის შედეგს,მას აქვს სამი მდგომარეობა:pending მოლოდინის რეჟიმი,fulfuled წარმატებით დასსრულდა.rejected წარუმატებლად დასრულდა.
// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
//all ელოდება ყველა პრომისის შესრულებას და აბრუნებს მასივს ყველა შედეგით,თუ ერთთი მაინც დაფეილდა,რეჯექთდება,race აბრუნებს იმ პრომისის შედეგს რომელივ ყველაზე პირველი დაასრულებს მუშაობას,არ აქვს მნიშვლენობა წარმატებით დასრულდა თუ არა,ხოლო any აბრუნებს პირველ წარმატებულ პრომიდდ,აიგნორებს დაფეილებულებს ის მხოლოდ მაშინ რეჯექთდება თუ ყველა პრომისი დაფეილდა.
// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
//სინტაქსური დანამატი  Promise-ებზე სამუშაოდ. ის გვეხმარება ასინქრონული კოდი დავწეროთ ისე, თითქოს ის სინქრონული იყოს. ეს კოდს ბევრად უფრო მარტივად წაკითხვადს და აღქმადს ხდის, და გვაშორებს რთულ .then() და .catch() ჯაჭვებს.
// 11)რა განსხვავებაა class-სა და object-ს შორის?
//class: არის შაბლონი ობიექტების შესაქმნელად. ის აღწერს, თუ რა თვისებები და მეთოდები უნდა ჰქონდეს მისგან შექმნილ ობიექტებს.
//Object: არის კლასის კონკრეტული ეგზემპლარი.
// 12)რას აკეთებს constructor class-ში?
//ეს არის სპეციალური მეთოდი კლასის შიგნით, რომელიც ავტომატურად ეშვება მაშინ, როდესაც ამ კლასიდან new ქივორდით ვქმნით ახალ ობიექტს. მისი მთავარი დანიშნულებაა ახლად შექმნილი ობიექტის საწყისი მნიშვნელობების ინიციალიზაცია.
//13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
//Memory Stack  გამოიყენება სტატიკური მეხსიერების ალოკაციისთვის. აქ ინახება პრიმიტიული ტიპები და ფუნქციების გამოძახების კონტექსტი.

//Memory Heap არის დიდი, ნაკლებად სტრუქტურირებული მეხსიერების არეალი. გამოიყენება დინამიური მეხსიერების ალოკაციისთვის, სადაც ინახება რთული სტრუქტურები – ობიექტები, მასივები, ფუნქციები.
//14) რა არის ქოლსტეკი
//ეს არის მონაცემთა სტრუქტურა (მუშაობს LIFO - Last In, First Out პრინციპით), რომელსაც JavaScript იყენებს ფუნქციების გამოძახების (call-ების) ტრეკინგისთვის. როდესაც ფუნქციას ვიძახებთ, ის ემატება Call Stack-ის თავში. როდესაც ფუნქცია ასრულებს მუშაობას, ის ამოვარდება (pop off) სტეკიდან. ეს ეხმარება ენას იცოდეს, თუ სად იმყოფება კოდის შესრულების მომენტში.
//15) რა არის ივენთ ლუპი
//JavaScript არის Single-threaded, ის იყენებს Event Loop-ს ასინქრონული ოპერაციების სამართავად. ივენთ ლუპის მექანიზმი გამუდმებით ამოწმებს: არის თუ არა Call Stack ცარიელი? თუ სტეკი ცარიელია, ის იღებს მომლოდინე ასინქრონულ ამოცანებს (მაგალითად ტაიმერებს, API მოთხოვნებს ქოლბექების რიგიდან - Task Queue / Microtask Queue) და შეაქვს მათ Call Stack-ში შესასრულებლად.
